faculty_message = 'Для початку вибери свій факультет |⤵'
faculty_confirm = 'Твій факультет - '
group_message = 'Тепер вибери свою групу |⤵'
group_confirm = 'Твоя група - '

admin_username = '@pumesiN'

hi_text = '👋| Вітання!\n\n' \
          "🤖| Цей бот призначений для допомоги студентам <b>ЛТЕУ</b>.\n" \
          '🧾| Він буде сповіщати Вас про <b>розклад пар щодня</b> і коротко інформувати Вас про пари наступного дня.\n' \
          '📌| Свої ідеї для розширення функціонала бота присилайте адміністратору.\n\n' \
          f'⚠️| <b>Адміністратор бота {admin_username}, про всі проблеми прошу інформувати його в першу чергу.</b> |⚠️'

day_text = 'Вибери день тижня |⤵'

b_notification = '📢| Повідомлення |📢'
b_on_off = '🟩| Увімкнути / Вимкнути |🟥'
on_ntfc = '⚠️| Ви увімкнули повідомлення!'
off_ntfc = '⚠️| Ви вимкнули повідомлення!'

a_hi = 'Добрий день! Сайт для редагування розкладу - <a href="http://127.0.0.1:8000/admin/">клікабельно</a>'

b_timetable = '📝| Розклад |📝'
b_settings = '⚙| Налаштування |⚙'
b_admin = '👨‍💻| Адмін-меню |👨‍💻'

b_newsletter = 'Розсилка'
a_newsletter = 'Надрукуй і відправ текст'
b_send_news = 'Відправити'

b_menu_chosen = 'Вибери категорію |⤵️'

b_group = '📊| Вибір групи |📊'

error_func = '🙅| Функція тимчасово недоступна'
error_text = '⚠️| Користуйтесь клавіатурою!'

b_cancel = 'Скасування'
b_back = 'Назад'

# РОЗКЛАД

none_text = f'Розкладу немає. Обери інший день або звернись до адміністратора - {admin_username}.'

odd = 'Лекційний тиждень'
even = 'Практичний тиждень'

hi_pre = '📢| Добрий вечір! Інформація про першу пару на завтра.\n\n'
hi = '📢| Добрий ранок. Розклад пар сьогодні:\n\n'

monday = 'Понеділок'
tuesday = 'Вівторок'
wednesday = 'Середа'
thursday = 'Четвер'
friday = "П'ятниця"
saturday = 'Субота'

pair_name = {
    1: 'Перша пара',
    2: 'Друга пара',
    3: 'Третя пара',
    4: 'Четверта пара',
    5: "П'ята пара",
    6: 'Шоста пара'
}

pre_form = '<b>{0}</b>\n' \
      '🏫| Місце: <b>{1}</b>\n' \
      '🕣| Початок: <b>{2}</b>*\n' \
      '🕜| Кінець пар: <b>{3}</b>*\n' \
      '🗿| Пар всього: <b>{4}</b>*\n\n'

pairs_forms = {  # par: 0 - pair num, 1 - pair name, 2 - start/end time, 3 - classroom
    1: '1️⃣| {0}: <b>{1} | {2} | {3}</b>\n\n',
    2: '2️⃣| {0}: <b>{1} | {2} | {3}</b>\n\n',
    3: '3️⃣| {0}: <b>{1} | {2} | {3}</b>\n\n',
    4: '4️⃣| {0}: <b>{1} | {2} | {3}</b>\n\n',
    5: '5️⃣| {0}: <b>{1} | {2} | {3}</b>\n\n',
    6: '6️⃣| {0}: <b>{1} | {2} | {3}</b>\n\n'
}

pre_footer = '* - в увагу беруться <b>вибіркові дисципліни</b>, уточнюйте <b>розклад в боті</b>.'
form_footer = '* - вибіркова дисципліна.'
